
class Converter:
    def __init__(self):
        self.unit_classes = {1: "Вес", 2: "Расстояние", 3: "Объем",
                             4: "Площадь", 5: "Температура", 6: "Скорость"}
        # 1 килограмм = ...
        self.weight = {"килограмм": 1, "карат": 5000,
                       "грамм": 1000, "тонна": 0.001,
                       "фунт": 2.205, "унция": 35.27,
                       "драхма": 564.4, "гран": 15432,
                       }

        # 1 метр = ...
        self.distance = {"метр": 1, "сантиметр": 100,
                         "километр": 0.001, "миля": 0.0006214,
                         "ярд": 1.094, "фут": 3.281,
                         "лье": 0.0002071, "дюйм": 39.37,
                         }

        # 1 кубический метр
        self.volume = {"кубический метр": 1, " кубический сантиметр": 1000000,
                       "литр": 1000, "миллилитр": 1000000,
                       "галлон": 264.2, "пинта": 2113,
                       "жидкая унция": 33814, "жидкая драхма": 270512,
                       }

        # 1 квадратный метр = ...
        self.weight = {"квадратный метр": 1, "квадратный километр": 0.000001,
                       "гектар": 0.0001, "сотка": 0.01,
                       "акр": 0.0002471, "квадратный фут": 10.76,
                       }

        # 1 метр в секунду
        self.speed = {"метр в секунду": 1, " километр в час": 3.6,
                       "миля в час": 2.237, "фут в час": 11811,
                       "узел": 1.944,
                       }


    def print_unit_classes(self):
        for key, value in self.unit_classes.items():
            print(f'{key} -- {value}')

    def choose_unit_class(self, choice):
        pass


    def choose_unit(self, choice):
        return None


conv = Converter()
conv.print_unit_classes()